# SubCategories Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..SubCategories Property
Category Class See Also
---
Returns a map containing all of the subcategories of this category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CategoryNameMap SubCategories { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SubCategories As CategoryNameMap
	Get
```

Visual C++
---
```text
public:
property CategoryNameMap^ SubCategories {
	CategoryNameMap^ get ();
}
```

# ### Return Value
An empty map if the category has no subcategories.
# See Also
Category Class
Autodesk.Revit.DB Namespace